const rawData = [
    {
        year:2021, name:"熱帶風暴「彩雲」2103", totalH:"", alerts:[
            {type:"注意警報", start:"06月03日 21:00", end:"06月04日 18:00"}
        ]
    },
    {
        year:2021, name:"熱帶風暴「小熊」2104", totalH:"", alerts:[
            {type:"戒備警報", start:"06月11日 07:40", end:"06月11日 23:00"},
            {type:"強風警報", start:"06月11日 23:00", end:"06月12日 17:30"},
            {type:"戒備警報", start:"06月12日 17:30", end:"06月12日 22:00"}
        ]
    },
    {
        year:2021, name:"熱帶低氣壓 07W", totalH:"", alerts:[
            {type:"注意警報", start:"07月06日 07:30", end:"07月06日 15:30"}
        ]
    },
    {
        year:2021, name:"熱帶低氣壓 08W", totalH:"", alerts:[
            {type:"戒備警報", start:"07月06日 07:30", end:"07月07日 16:30"}
        ]
    },
    {
        year:2021, name:"颱風「查帕卡」2107", totalH:"", alerts:[
            {type:"戒備警報", start:"07月17日 16:00", end:"07月19日 13:45"},
            {type:"強風警報", start:"07月19日 13:45", end:"07月20日 15:00"},
            {type:"戒備警報", start:"07月20日 15:00", end:"07月21日 01:10"}
        ]
    },
    {
        year:2021, name:"熱帶風暴「盧碧」2109", totalH:"", alerts:[
            {type:"戒備警報", start:"08月02日 17:40", end:"08月03日 13:20"},
            {type:"強風警報", start:"08月03日 13:20", end:"08月04日 09:20"},
            {type:"戒備警報", start:"08月04日 09:20", end:"08月05日 17:20"}
        ]
    },
    {
        year:2021, name:"強烈熱帶風暴「康森」2113", totalH:"", alerts:[
            {type:"注意警報", start:"09月09日 13:00", end:"09月10日 15:00"}
        ]
    },
    {
        year:2021, name:"超強颱風「燦都」2114", totalH:"", alerts:[
            {type:"注意警報", start:"09月10日 15:00", end:"09月12日 15:30"}
        ]
    },
    {
        year:2021, name:"熱帶風暴「獅子山」2117", totalH:"", alerts:[
            {type:"戒備警報", start:"10月06日 21:40", end:"10月07日 22:40"},
            {type:"強風警報", start:"10月07日 22:40", end:"10月09日 06:20"},
            {type:"烈風預警警報", start:"10月09日 03:20", end:"10月09日 06:20"},
            {type:"東南烈風警報", start:"10月09日 06:20", end:"10月10日 00:20"},
            {type:"強風警報", start:"10月10日 00:20", end:"10月10日 13:40"},
            {type:"戒備警報", start:"10月10日 13:40", end:"10月10日 16:20"}
        ]
    },
    {
        year:2021, name:"颱風「圓規」2118", totalH:"", alerts:[
            {type:"戒備警報", start:"10月11日 19:40", end:"10月12日 00:20"},
            {type:"強風警報", start:"10月12日 00:20", end:"10月12日 21:20"},
            {type:"烈風預警警報", start:"10月12日 18:40", end:"10月12日 21:20"},
            {type:"東北烈風警報", start:"10月12日 21:20", end:"10月13日 14:40"},
            {type:"東南烈風警報", start:"10月13日 14:40", end:"10月13日 17:20"},
            {type:"強風警報", start:"10月13日 17:20", end:"10月14日 01:40"},
            {type:"戒備警報", start:"10月14日 01:40", end:"10月14日 10:40"}
        ]
    },
    {
        year:2021, name:"超強颱風「雷伊」2122", totalH:"", alerts:[
            {type:"注意警報", start:"12月18日 20:40", end:"12月20日 00:40"},
            {type:"戒備警報", start:"12月20日 00:40", end:"12月21日 15:20"}
        ]
    },
    {
        year:2022, name:"颱風「暹芭」2203", totalH:"", alerts:[
            {type:"戒備警報", start:"06月29日 18:20", end:"07月01日 01:20"},
            {type:"強風警報", start:"07月01日 01:20", end:"07月01日 19:20"},
            {type:"烈風預警警報", start:"07月01日 17:40", end:"07月01日 19:20"},
            {type:"東南烈風警報", start:"07月01日 19:20", end:"07月02日 09:40"},
            {type:"暴風警報", start:"07月02日 09:40", end:"07月02日 12:20"},
            {type:"東南烈風警報", start:"07月02日 12:20", end:"07月02日 17:20"},
            {type:"強風警報", start:"07月02日 17:20", end:"07月03日 15:20"},
            {type:"戒備警報", start:"07月03日 15:20", end:"07月03日 19:20"}
        ]
    },
    {
        year:2022, name:"熱帶低氣壓 08W", totalH:"", alerts:[
            {type:"戒備警報", start:"08月03日 18:20", end:"08月04日 17:40"}
        ]
    },
    {
        year:2022, name:"熱帶風暴「木蘭」2207", totalH:"", alerts:[
            {type:"戒備警報", start:"08月08日 15:40", end:"08月09日 11:20"},
            {type:"強風警報", start:"08月09日 11:20", end:"08月10日 06:20"},
            {type:"烈風預警警報", start:"08月10日 04:20", end:"08月10日 06:20"},
            {type:"東南烈風警報", start:"08月10日 06:20", end:"08月10日 14:20"},
            {type:"強風警報", start:"08月10日 14:20", end:"08月10日 19:20"}
        ]
    },
    {
        year:2022, name:"颱風「馬鞍」2209", totalH:"", alerts:[
            {type:"注意警報", start:"08月22日 23:20", end:"08月23日 19:20"},
            {type:"戒備警報", start:"08月23日 19:20", end:"08月24日 13:20"},
            {type:"強風警報", start:"08月24日 13:20", end:"08月24日 20:20"},
            {type:"烈風預警警報", start:"08月24日 18:20", end:"08月24日 20:20"},
            {type:"東北烈風警報", start:"08月24日 20:20", end:"08月25日 02:40"},
            {type:"東南烈風警報", start:"08月25日 02:40", end:"08月25日 10:40"},
            {type:"強風警報", start:"08月25日 10:40", end:"08月25日 16:20"}
        ]
    },
    {
        year:2022, name:"強颱風「納沙」2220", totalH:"", alerts:[
            {type:"戒備警報", start:"10月16日 10:40", end:"10月17日 13:40"},
            {type:"強風警報", start:"10月17日 13:40", end:"10月18日 20:40"}
        ]
    },
    {
        year:2022, name:"颱風「尼格」2222", totalH:"", alerts:[
            {type:"注意警報", start:"10月29日 20:40", end:"10月30日 20:40"},
            {type:"戒備警報", start:"10月30日 20:40", end:"10月31日 13:40"},
            {type:"強風警報", start:"10月31日 13:40", end:"11月02日 20:20"},
            {type:"烈風預警警報", start:"11月02日 17:40", end:"11月02日 20:20"},
            {type:"西北烈風警報", start:"11月02日 20:20", end:"11月03日 05:40"},
            {type:"強風警報", start:"11月03日 05:40", end:"11月03日 07:40"}
        ]
    },
    {
        year:2023, name:"颱風「泰利」2304", totalH:"", alerts:[
            {type:"注意警報", start:"07月14日 12:20", end:"07月14日 20:20"},
            {type:"戒備警報", start:"07月14日 20:20", end:"07月16日 11:20"},
            {type:"強風警報", start:"07月16日 11:20", end:"07月17日 01:20"},
            {type:"烈風預警警報", start:"07月17日 00:20", end:"07月17日 01:20"},
            {type:"東北烈風警報", start:"07月17日 01:20", end:"07月17日 11:20"},
            {type:"東南烈風警報", start:"07月17日 11:20", end:"07月17日 19:20"},
            {type:"強風警報", start:"07月17日 19:20", end:"07月18日 10:20"}
        ]
    },
    {
        year:2023, name:"超強颱風「杜蘇芮」2305", totalH:"", alerts:[
            {type:"戒備警報", start:"07月26日 19:20", end:"07月28日 11:20"}
        ]
    },
    {
        year:2023, name:"超強颱風「蘇拉」2309", totalH:"", alerts:[
            {type:"注意警報", start:"08月29日 20:20", end:"08月30日 14:20"},
            {type:"戒備警報", start:"08月30日 14:20", end:"08月31日 22:20"},
            {type:"強風警報", start:"08月31日 22:20", end:"09月01日 09:20"},
            {type:"烈風預警警報", start:"09月01日 06:20", end:"09月01日 09:20"},
            {type:"西北烈風警報", start:"09月01日 09:20", end:"09月01日 21:20"},
            {type:"暴風警報", start:"09月01日 21:20", end:"09月01日 23:20"},
            {type:"颶風警報", start:"09月01日 23:20", end:"09月02日 05:20"},
            {type:"東南烈風警報", start:"09月02日 05:20", end:"09月02日 12:20"},
            {type:"強風警報", start:"09月02日 12:20", end:"09月03日 00:20"}
        ]
    },
    {
        year:2023, name:"強颱風「海葵」2311", totalH:"", alerts:[
            {type:"戒備警報", start:"09月04日 00:20", end:"09月05日 13:20"}
        ]
    },
    {
        year:2023, name:"超強颱風「小犬」2314", totalH:"", alerts:[
            {type:"注意警報", start:"10月05日 13:20", end:"10月06日 01:20"},
            {type:"戒備警報", start:"10月06日 01:20", end:"10月07日 01:20"},
            {type:"強風警報", start:"10月07日 01:20", end:"10月08日 17:20"},
            {type:"烈風預警警報", start:"10月08日 13:20", end:"10月08日 17:20"},
            {type:"東北烈風警報", start:"10月08日 17:20", end:"10月09日 08:20"},
            {type:"強風警報", start:"10月09日 08:20", end:"10月09日 12:20"}
        ]
    },
    {
        year:2023, name:"強烈熱帶風暴「三巴」2316", totalH:"", alerts:[
            {type:"戒備警報", start:"10月18日 17:20", end:"10月20日 21:20"}
        ]
    },
    {
        year:2024, name:"熱帶風暴「馬力斯」2402", totalH:"", alerts:[
            {type:"戒備警報", start:"05月30日 13:20", end:"05月31日 18:20"},
            {type:"強風警報", start:"05月31日 18:20", end:"06月01日 18:20"}
        ]
    },
    {
        year:2024, name:"超強颱風「格美」2403", totalH:"", alerts:[
            {type:"戒備警報", start:"07月25日 15:20", end:"07月25日 21:40"},
            {type:"強風警報", start:"07月25日 21:40", end:"07月26日 15:20"}
        ]
    },
    {
        year:2024, name:"強烈熱帶風暴「派比安」2404", totalH:"", alerts:[
            {type:"戒備警報", start:"07月20日 08:40", end:"07月22日 14:20"}
        ]
    },
    {
        year:2024, name:"超強颱風「摩羯」2411", totalH:"", alerts:[
            {type:"注意警報", start:"09月02日 23:40", end:"09月03日 18:20"},
            {type:"戒備警報", start:"09月03日 18:20", end:"09月05日 07:40"},
            {type:"強風警報", start:"09月05日 07:40", end:"09月05日 20:20"},
            {type:"烈風預警警報", start:"09月05日 17:20", end:"09月05日 20:20"},
            {type:"東北烈風警報", start:"09月05日 20:20", end:"09月06日 13:20"},
            {type:"強風警報", start:"09月06日 13:20", end:"09月07日 10:20"}
        ]
    },
    {
        year:2024, name:"超強颱風「山陀兒」2418", totalH:"", alerts:[
            {type:"戒備警報", start:"10月01日 00:20", end:"10月01日 19:20"},
            {type:"強風警報", start:"10月01日 19:20", end:"10月02日 19:20"}
        ]
    },
    {
        year:2024, name:"颱風「潭美」2420", totalH:"", alerts:[
            {type:"戒備警報", start:"10月25日 07:40", end:"10月25日 23:40"},
            {type:"強風警報", start:"10月25日 23:40", end:"10月26日 21:40"}
        ]
    },
    {
        year:2024, name:"超強颱風「銀杏」2422", totalH:"", alerts:[
            {type:"戒備警報", start:"11月08日 13:20", end:"11月10日 01:40"},
            {type:"強風警報", start:"11月10日 01:40", end:"11月10日 13:20"}
        ]
    },
    {
        year:2024, name:"颱風「桃芝」2423", totalH:"", alerts:[
            {type:"注意警報", start:"11月11日 13:20", end:"11月12日 08:20"},
            {type:"戒備警報", start:"11月12日 08:20", end:"11月13日 18:20"},
            {type:"強風警報", start:"11月13日 18:20", end:"11月15日 02:20"}
        ]
    },
    {
        year:2024, name:"超強颱風「萬宜」2424", totalH:"", alerts:[
            {type:"強風警報", start:"11月18日 13:20", end:"11月19日 20:20"},
            {type:"戒備警報", start:"11月19日 20:20", end:"11月20日 01:40"}
        ]
    },
    {
        year:2025, name:"颱風「蝴蝶」2501", totalH:"109h 00m", alerts:[
            {type:"戒備警報", start:"06月11日 01:20", end:"06月11日 22:20"},
            {type:"強風警報", start:"06月11日 22:20", end:"06月12日 18:20"},
            {type:"戒備警報", start:"06月12日 18:20", end:"06月14日 02:20"},
            {type:"強風警報", start:"06月14日 02:20", end:"06月15日 14:20"}
        ]
    },
    {
        year:2025, name:"熱帶低氣壓 08W", totalH:"42h 00m", alerts:[
            {type:"戒備警報", start:"06月25日 01:20", end:"06月26日 19:20"}
        ]
    },
    {
        year:2025, name:"強颱風 「丹娜絲」2504", totalH:"56h 40m", alerts:[
            {type:"戒備警報", start:"07月04日 13:40", end:"07月06日 13:20"},
            {type:"戒備警報", start:"07月09日 15:20", end:"07月10日 00:20"}
        ]
    },
    {
        year:2025, name:"颱風「韋帕」2506", totalH:"64h 20m", alerts:[
            {type:"注意警報", start:"07月18日 12:20", end:"07月19日 04:20"},
            {type:"戒備警報", start:"07月19日 04:20", end:"07月19日 16:20"},
            {type:"強風警報", start:"07月19日 16:20", end:"07月20日 03:20"},
            {type:"烈風預警警報", start:"07月19日 23:40", end:"07月20日 03:20"},
            {type:"西北烈風警報", start:"07月20日 03:20", end:"07月20日 09:40"},
            {type:"暴風警報", start:"07月20日 09:40", end:"07月20日 13:40"},
            {type:"颶風警報", start:"07月20日 13:40", end:"07月20日 16:40"},
            {type:"強風警報", start:"07月20日 16:40", end:"07月21日 04:40"}
        ]
    },
    {
        year:2025, name:"強颱風「楊柳」2511", totalH:"24h 00m", alerts:[
            {type:"戒備警報", start:"08月13日 13:20", end:"08月14日 13:20"}
        ]
    },
    {
        year:2025, name:"熱帶低氣壓 17W", totalH:"33h 40m", alerts:[
            {type:"注意警報", start:"08月17日 02:40", end:"08月17日 08:20"},
            {type:"強風警報", start:"08月17日 08:20", end:"08月18日 00:20"},
            {type:"戒備警報", start:"08月18日 00:20", end:"08月18日 12:20"}
        ]
    },
    {
        year:2025, name:"強颱風「劍魚」2513", totalH:"41h 40m", alerts:[
            {type:"戒備警報", start:"08月23日 02:40", end:"08月23日 20:20"},
            {type:"強風警報", start:"08月23日 20:20", end:"08月24日 20:20"}
        ]
    },
    {
        year:2025, name:"熱帶風暴「藍湖」2514", totalH:"31h 00m", alerts:[
            {type:"戒備警報", start:"08月28日 17:20", end:"08月29日 07:20"},
            {type:"強風警報", start:"08月29日 07:20", end:"08月30日 00:20"}
        ]
    },
    {
        year:2025, name:"強烈熱帶風暴「塔巴」2516", totalH:"72h 00m", alerts:[
            {type:"注意警報", start:"09月05日 17:20", end:"09月06日 10:20"},
            {type:"戒備警報", start:"09月06日 10:20", end:"09月07日 10:20"},
            {type:"強風警報", start:"09月07日 10:20", end:"09月07日 21:20"},
            {type:"烈風預警警報", start:"09月07日 18:20", end:"09月07日 21:20"},
            {type:"東北烈風警報", start:"09月07日 21:20", end:"09月08日 04:20"},
            {type:"東南烈風警報", start:"09月08日 04:20", end:"09月08日 12:20"},
            {type:"強風警報", start:"09月08日 12:20", end:"09月08日 17:20"}
        ]
    },
    {
        year:2025, name:"強烈熱帶風暴「米娜」2517", totalH:"79h 00m", alerts:[
            {type:"注意警報", start:"09月17日 01:20", end:"09月18日 09:20"},
            {type:"戒備警報", start:"09月18日 09:20", end:"09月19日 11:20"},
            {type:"強風警報", start:"09月19日 11:20", end:"09月20日 08:20"}
        ]
    },
    {
        year:2025, name:"超強颱風「樺加沙」2518", totalH:"103h 00m", alerts:[
            {type:"注意警報", start:"09月21日 10:20", end:"09月22日 10:20"},
            {type:"戒備警報", start:"09月22日 10:20", end:"09月23日 10:20"},
            {type:"強風警報", start:"09月23日 10:20", end:"09月23日 21:20"},
            {type:"烈風預警警報", start:"09月23日 18:20", end:"09月23日 21:20"},
            {type:"西北烈風警報", start:"09月23日 21:20", end:"09月24日 02:40"},
            {type:"暴風警報", start:"09月24日 02:40", end:"09月24日 09:50"},
            {type:"颶風警報", start:"09月24日 09:50", end:"09月24日 14:20"},
            {type:"暴風警報", start:"09月24日 14:20", end:"09月24日 16:20"},
            {type:"東南烈風警報", start:"09月24日 16:20", end:"09月25日 01:20"},
            {type:"強風警報", start:"09月25日 01:20", end:"09月25日 17:20"}
        ]
    },
    {
        year:2025, name:"颱風「麥德姆」2521", totalH:"62h 00m", alerts:[
            {type:"注意警報", start:"10月03日 08:20", end:"10月03日 22:20"},
            {type:"戒備警報", start:"10月03日 22:20", end:"10月04日 15:20"},
            {type:"強風警報", start:"10月04日 15:20", end:"10月04日 23:20"},
            {type:"烈風預警警報", start:"10月04日 22:40", end:"10月04日 23:20"},
            {type:"東南烈風警報", start:"10月04日 23:20", end:"10月05日 01:20"},
            {type:"暴風警報", start:"10月05日 01:20", end:"10月05日 09:20"},
            {type:"東南烈風警報", start:"10月05日 09:20", end:"10月05日 15:20"},
            {type:"強風警報", start:"10月05日 15:20", end:"10月05日 22:20"}
        ]
    },
    {
        year:2025, name:"強烈熱帶風暴「風神」2524", totalH:"62h 00m", alerts:[
            {type:"注意警報", start:"10月19日 10:20", end:"10月19日 22:20"},
            {type:"戒備警報", start:"10月19日 22:20", end:"10月20日 16:20"},
            {type:"強風警報", start:"10月20日 16:20", end:"10月21日 18:20"},
            {type:"戒備警報", start:"10月21日 18:20", end:"10月22日 00:20"}
        ]
    },
    {
        year:2025, name:"超強颱風「鳳凰」2526", totalH:"38h 00m", alerts:[
            {type:"戒備警報", start:"11月10日 14:20", end:"11月12日 04:20"}
        ]
    },
    {
        year:2026, name:"颱風「美莎克」2610", totalH:"63h 00m", alerts:[
            {type:"戒備警報", start:"07月02日 02:20", end:"07月03日 11:20"},
            {type:"強風警報", start:"07月03日 11:20", end:"07月04日 17:20"}
        ]
    },
    {
        year:2026, name:"熱帶低氣壓 99W", totalH:"18h 20m", alerts:[
            {type:"注意警報", start:"07月13日 22:20", end:"07月14日 10:40"},
            {type:"戒備警報", start:"07月14日 10:40", end:"07月14日 16:40"}
        ]
    },
    {
        year:2026, name:"颱風「紅霞」2612", totalH:"56h 00m", alerts:[
            {type:"注意警報", start:"07月24日 08:20", end:"07月24日 22:20"},
            {type:"戒備警報", start:"07月24日 22:20", end:"07月25日 17:20"},
            {type:"強風警報", start:"07月25日 17:20", end:"07月26日 07:20"},
            {type:"西南烈風警報", start:"07月26日 07:20", end:"07月26日 16:20"}
        ]
    },
    {
        year:2026, name:"熱帶風暴「紫檀」2619", totalH:"52h 00m", alerts:[
            {type:"強風警報", start:"08月19日 21:20", end:"08月20日 13:20"},
            {type:"戒備警報", start:"08月25日 02:20", end:"08月26日 14:20"}
        ]
    },      
    {
        year: 2026, name: "超強颱風「沙德爾」2618", totalH: "84h 40m", alerts: [
            { type: "注意警報", start: "08月31日 11:40", end: "08月31日 19:40" },
            { type: "戒備警報", start: "08月31日 19:40", end: "09月01日 13:20" },
            { type: "強風警報", start: "09月01日 13:20", end: "09月02日 14:20" },
            { type: "戒備警報", start: "09月02日 14:20", end: "09月04日 00:20" }
        ]
    }
];
